AMEv2/AMEv2-Firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_IO_PIN_DS18B20=40
CONFIG_TEMPERATURE_SLOW_DOWN=40
CONFIG_CHAM_MIN_CASE_LENGTH=32000
CONFIG_CHAM_MAX_CASE_LENGTH=72500
CONFIG_APPTRACE_DEST_USB_CDC=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD=y
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=10
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_OPENTHREAD_RX_ON_WHEN_IDLE=y
